---
kind: property
id: P:Autodesk.Revit.DB.WorksetPreview.Name
source: html/d500b987-3c31-be31-9a3b-51dbad59bb7b.htm
---
# Autodesk.Revit.DB.WorksetPreview.Name Property

Name of the workset.

## Syntax (C#)
```csharp
public string Name { get; }
```

## Remarks
Name is case-insensitive.